app/controllers/admin/settings_controller.rb

SELECT  "settings".* FROM "settings"  WHERE "settings"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@settings = Setting.find(1)

SELECT  "settings".* FROM "settings"  WHERE "settings"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "settings" SET "site_copyright" = $1, "site_title" = $2, "updated_at" = $3 WHERE "settings"."id" = 1  [["site_copyright", "Copyright &copy; 2015 Katata Network. All Rights Reserved."], ["site_title", "Kontract Networz - Awesome Services"], ["updated_at", "2014-09-12 23:46:28.876493"]]
---
	def update
		setting = Setting.find(1)

		if setting.update_attributes(setting_params)