app/controllers/admin/subpages_controller.rb

	def index
		@subpages = Subpage.all
---
SELECT "subpages".* FROM "subpages"

	def edit
		@subpages = Subpage.all
		@subpage_to_edit = @subpages.find(params[:id])
---
SELECT "subpages".* FROM "subpages"
SELECT  "subpages".* FROM "subpages"  WHERE "subpages"."id" = $1 LIMIT 1  [["id", 1]]